---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseDistance
source: html/2ae0bbd4-36cc-0668-6874-5959c5cba7aa.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseDistance Property

"Base Attachment Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentBaseDistance { get; }
```